
//здесь задается критерий ненахождения объекта метаданных на поддержке поставщика
Функция ПрефиксОбъектовНеНаПоддержке() Экспорт
	возврат "мт_";
КонецФункции

Функция МенеджерыОбъектовСНастройкамиТестирования() Экспорт
	
	Результат = Новый Массив;
	
	//пример:
	//Результат.Добавить(Документы.ОтчетПереработчика);
	//Результат.Добавить(Документы.ПланПроизводства);
	//Результат.Добавить(Документы.ПриобретениеТоваровУслуг);
	//Результат.Добавить(Документы.ЭтапПроизводства2_2);
	//Результат.Добавить(Документы.мт_АктОБраке);
	//Результат.Добавить(Документы.мт_ЗаявкаНаКонтрольОТК);
	//Результат.Добавить(Документы.мт_ПроверкаОТК);
	//Результат.Добавить(Документы.мт_ПроизводственныеПартии);
	//Результат.Добавить(Документы.мт_СборочнаяВедомость);
	//
	//Результат.Добавить(Отчеты.мт_ВедомостьПоЗаказамКлиентов);
	//Результат.Добавить(Отчеты.мт_ОстаткиСерийныхНомеровНовый);
	//
	//Результат.Добавить(Обработки.ПечатьОбщихФорм);
	
	Возврат Результат;
	
КонецФункции

#Область ПользователиТестирования

//длина идентификатора - не более 50 символов (см. процедуру мт_ТестированиеКонфигурацииСлужебный.ПустаяТаблицаСценариевТестирования())

Функция Пользователь_МастерСборки() Экспорт
	
	Возврат "МастерСборки";
	
КонецФункции

Функция Пользователь_МатериальноТехническоеСнабжение() Экспорт
	
	Возврат "МатериальноТехническоеСнабжение";
	
КонецФункции

Функция Пользователь_ПолныеПрава() Экспорт
	
	Возврат "";
	
КонецФункции

#КонецОбласти

Функция ИмяИПарольПользователя(РольПользователя) Экспорт
	
	ИмяПароль = Новый Структура("Имя, Пароль");
	
	Если РольПользователя = Пользователь_ПолныеПрава() Тогда
	
	ИначеЕсли РольПользователя = Пользователь_МастерСборки() Тогда
		
		ИмяПароль.Имя = "ИвановИИ";
		ИмяПароль.Пароль = "123";
		
	ИначеЕсли РольПользователя = Пользователь_МатериальноТехническоеСнабжение() Тогда
		
		ИмяПароль.Имя = "ПетровНН";
		ИмяПароль.Пароль = "123";
		
	Иначе
		
		ВызватьИсключение "Непредусмотренный пользователь: "+РольПользователя;
		
	КонецЕсли;
		
	возврат ИмяПароль;
	
КонецФункции