
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	НесоответствиеОстатков = ПолучитьНесоответствияОстатков(ПараметрКоманды);
	Если НесоответствиеОстатков.ЕстьНесоответствия Тогда
		НесоответствиеОстатков.ТабличныйДокумент.Показать(
			СтрШаблон("Несоответствия остатков: %1 на %2", 
			НесоответствиеОстатков.ИмяРегистра, Формат(НесоответствиеОстатков.ДатаОстатков, "ДФ=dd.MM.yyyy")));
	Иначе
		мт_ТестированиеКонфигурации_Клиент.ПоказатьСообщение_ОК("Остатки соответствуют эталонным");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНесоответствияОстатков(ДокументСсылка)
	
	Возврат Справочники.мт_Тестирование_ЭталонныеОстаткиРегистров.НесоответствиеОстатков(ДокументСсылка);
	
КонецФункции