
//здесь задается критерий ненахождения объекта метаданных на поддержке поставщика
Функция ПрефиксыОбъектовНеНаОсновнойПоддержке() Экспорт
	Префиксы = Новый Массив;
	Префиксы.Добавить("мт_");
	возврат Префиксы;
КонецФункции

Функция МенеджерыОбъектовСоСценариямиТестирования() Экспорт
	
	Результат = Новый Массив;
	//Результат.Добавить(АвансовыйОтчетЛокализация);
	
	Возврат Результат;
	
КонецФункции

#Область ПользователиТестирования

//длина идентификатора - не более 50 символов (см. процедуру мт_ТестированиеКонфигурацииСлужебный.ПустаяТаблицаСценариевТестирования())

Функция Пользователь_МастерСборки() Экспорт
	
	Возврат "МастерСборки";
	
КонецФункции

Функция Пользователь_ПолныеПрава() Экспорт
	
	Возврат "";
	
КонецФункции

#КонецОбласти

Функция ИмяИПарольПользователя(РольПользователя) Экспорт
	
	ИмяПароль = Новый Структура("Имя, Пароль");
	
	Если РольПользователя = Пользователь_ПолныеПрава() Тогда
	
	ИначеЕсли РольПользователя = Пользователь_МастерСборки() Тогда
		
		ИмяПароль.Имя = "Петров И.И.";
		ИмяПароль.Пароль = "12345";
		
	Иначе
		
		ВызватьИсключение "Непредусмотренный пользователь: "+РольПользователя;
		
	КонецЕсли;
		
	возврат ИмяПароль;
	
КонецФункции
