
//Эту функцию можно вызывать при  запуске системы
Процедура ПроверкаСохранностиКритическихМетаданных() Экспорт

	Отказ = Ложь;
	мт_ТестированиеКонфигурации_Сервер.ПроверкаСохранностиКритическихМетаданных(Отказ);

	Если Отказ Тогда

		ПоказатьПредупреждение( , "Обнаружены ошибки при проверке конфигурации (см. журнал регистрации)");

	КонецЕсли;

КонецПроцедуры

Функция ПоказатьСообщение_ОК(ТекстСообщения) Экспорт

	ОткрытьФорму("ОбщаяФорма.мт_Информация_ОК", Новый Структура("ТекстСообщения", ТекстСообщения));

КонецФункции